; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image1 - mode
	image2 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	GroundStation10 - direction
	Star9 - direction
	Star0 - direction
	Star7 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	Star11 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star7)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star11)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation8)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite3 GroundStation10)
	(have_image Planet12 thermograph0)
	(have_image Phenomenon13 image1)
	(have_image Star14 thermograph0)
))

)

; plan
1. (turn_to satellite1 star0 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star0)
   goals met: 1 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 5
3. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 5
4. (turn_to satellite1 planet12 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet12)
   goals met: 0 of 5
5. (take_image satellite1 planet12 instrument1 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 1 of 5
6. (turn_to satellite1 phenomenon13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 5
7. (take_image satellite1 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 2 of 5
8. (turn_to satellite1 star14 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star14)
   goals met: 2 of 5
9. (take_image satellite1 star14 instrument1 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 3 of 5
10. (turn_to satellite1 star0 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star0)
   goals met: 4 of 5
11. (turn_to satellite3 groundstation10 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 groundstation10)
   goals met: 5 of 5
